## Pandas Basics

In [1]:
# Written by Tyler Beetle for Python for Data Science and Machine Learning Bootcamp Udemy Course.

In [6]:
import numpy as np
import pandas as pd

In [8]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a':10, 'b':20,'c':30}

In [9]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [13]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [19]:
ser1 = pd.Series([1,2,3,4],['USA','Italy','Mexico','Netherlands'])

In [20]:
ser1

USA            1
Italy          2
Mexico         3
Netherlands    4
dtype: int64

In [21]:
ser2 = pd.Series([1,2,3,4],['USA','Italy','Taiwan','Netherlands'])

In [22]:
ser2

USA            1
Italy          2
Taiwan         3
Netherlands    4
dtype: int64

In [24]:
ser3 = pd.Series(data=labels)

In [25]:
ser3[0]

'a'

In [26]:
ser1 + ser2

Italy          4.0
Mexico         NaN
Netherlands    8.0
Taiwan         NaN
USA            2.0
dtype: float64

In [27]:
from numpy.random import randn

In [28]:
np.random.seed(42)

In [29]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [30]:
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [31]:
df['W']

A    0.496714
B   -0.234153
C   -0.469474
D    0.241962
E   -1.012831
Name: W, dtype: float64

In [32]:
type(df)

pandas.core.frame.DataFrame

In [35]:
df[['W', 'Y']]

          W         Y
A  0.496714  0.647689
B -0.234153  1.579213
C -0.469474 -0.463418
D  0.241962 -1.724918
E -1.012831 -0.908024

In [44]:
df['new'] = df['W'] + df['Y']

In [45]:
df

          W         X         Y         Z       new
A  0.496714 -0.138264  0.647689  1.523030  1.144403
B -0.234153 -0.234137  1.579213  0.767435  1.345059
C -0.469474  0.542560 -0.463418 -0.465730 -0.932892
D  0.241962 -1.913280 -1.724918 -0.562288 -1.482956
E -1.012831  0.314247 -0.908024 -1.412304 -1.920855

In [46]:
df.drop('new', axis=1, inplace=True)

In [47]:
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [48]:
df.drop('E', axis=0)

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288

In [49]:
df.shape

(5, 4)

In [50]:
df.loc['A']

W    0.496714
X   -0.138264
Y    0.647689
Z    1.523030
Name: A, dtype: float64

In [52]:
df.iloc[1]

W   -0.234153
X   -0.234137
Y    1.579213
Z    0.767435
Name: B, dtype: float64

In [54]:
df.loc['B','Y']

1.5792128155073915

In [56]:
df.loc[['A','B'], ['W','Y']]

          W         Y
A  0.496714  0.647689
B -0.234153  1.579213

In [59]:
booldf = df > 0

In [60]:
df[booldf]

          W         X         Y         Z
A  0.496714       NaN  0.647689  1.523030
B       NaN       NaN  1.579213  0.767435
C       NaN  0.542560       NaN       NaN
D  0.241962       NaN       NaN       NaN
E       NaN  0.314247       NaN       NaN

In [62]:
df[df>0]

          W         X         Y         Z
A  0.496714       NaN  0.647689  1.523030
B       NaN       NaN  1.579213  0.767435
C       NaN  0.542560       NaN       NaN
D  0.241962       NaN       NaN       NaN
E       NaN  0.314247       NaN       NaN

In [63]:
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [64]:
df['W']>0

A     True
B    False
C    False
D     True
E    False
Name: W, dtype: bool

In [65]:
df['W']

A    0.496714
B   -0.234153
C   -0.469474
D    0.241962
E   -1.012831
Name: W, dtype: float64

In [66]:
df[df['W']>0]

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
D  0.241962 -1.913280 -1.724918 -0.562288

In [67]:
resultdf = df[df['W']>0]

In [69]:
resultdf['X']

A   -0.138264
D   -1.913280
Name: X, dtype: float64

In [70]:
df[df['W']>0]['X']

A   -0.138264
D   -1.913280
Name: X, dtype: float64

In [73]:
boolser = df['W'] > 0

In [74]:
result = df[boolser]

In [75]:
mycols = ['Y', 'X']

In [76]:
result[mycols]

          Y         X
A  0.647689 -0.138264
D -1.724918 -1.913280

In [83]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
D  0.241962 -1.913280 -1.724918 -0.562288

In [86]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.496714 -0.138264  0.647689  1.523030
1     B -0.234153 -0.234137  1.579213  0.767435
2     C -0.469474  0.542560 -0.463418 -0.465730
3     D  0.241962 -1.913280 -1.724918 -0.562288
4     E -1.012831  0.314247 -0.908024 -1.412304

In [87]:
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [94]:
newind = 'CA VA OR NC SC'.split()

In [95]:
newind

['CA', 'VA', 'OR', 'NC', 'SC']

In [96]:
df['States'] = newind

In [97]:
df

          W         X         Y         Z States
A  0.496714 -0.138264  0.647689  1.523030     CA
B -0.234153 -0.234137  1.579213  0.767435     VA
C -0.469474  0.542560 -0.463418 -0.465730     OR
D  0.241962 -1.913280 -1.724918 -0.562288     NC
E -1.012831  0.314247 -0.908024 -1.412304     SC

In [99]:
df.set_index('States', inplace=True)

In [100]:
df

               W         X         Y         Z
States
CA      0.496714 -0.138264  0.647689  1.523030
VA     -0.234153 -0.234137  1.579213  0.767435
OR     -0.469474  0.542560 -0.463418 -0.465730
NC      0.241962 -1.913280 -1.724918 -0.562288
SC     -1.012831  0.314247 -0.908024 -1.412304

In [101]:
outside = ['A1', 'A1', 'A1', 'A2', 'A2', 'A2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [102]:
df = pd.DataFrame(randn(6,2), hier_index,['A','B'])

In [103]:
df

             A         B
A1 1  1.465649 -0.225776
   2  0.067528 -1.424748
   3 -0.544383  0.110923
A2 1 -1.150994  0.375698
   2 -0.600639 -0.291694
   3 -0.601707  1.852278

In [104]:
df.loc['A1']

          A         B
1  1.465649 -0.225776
2  0.067528 -1.424748
3 -0.544383  0.110923

In [105]:
df.loc['A2'].loc[2]

A   -0.600639
B   -0.291694
Name: 2, dtype: float64

In [107]:
df.index.names = ['Area', 'Ind']

In [108]:
df

                 A         B
Area Ind
A1   1    1.465649 -0.225776
     2    0.067528 -1.424748
     3   -0.544383  0.110923
A2   1   -1.150994  0.375698
     2   -0.600639 -0.291694
     3   -0.601707  1.852278

In [118]:
df.xs(1,level='Ind')

             A         B
Area
A1    1.465649 -0.225776
A2   -1.150994  0.375698

In [113]:
df.loc['A1'].loc[2]['A']

0.06752820468792384

In [119]:
dic = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [121]:
df = pd.DataFrame(dic)

In [122]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [123]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [124]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [129]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [130]:
df.fillna(value='FILLER')

        A       B  C
0     1.0     5.0  1
1     2.0  FILLER  2
2  FILLER  FILLER  3

In [134]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [141]:
data = {'Team':['Commanders', 'Cowboys', 'Giants', 'Eagles'],
       'QB': ['Jaden', 'Dak', 'Daniel', 'Jalen'],
       'College': ['LSU', 'Miss State', 'Duke', 'Oklahoma']}

In [142]:
df = pd.DataFrame(data)

In [143]:
df

         Team      QB     College
0  Commanders   Jaden         LSU
1     Cowboys     Dak  Miss State
2      Giants  Daniel        Duke
3      Eagles   Jalen    Oklahoma

In [145]:
byColl = df.groupby('College')

In [149]:
df['Jersey_Number'] = ['5','4','8','1']

In [150]:
df

         Team      QB     College Jersey_Number
0  Commanders   Jaden         LSU             5
1     Cowboys     Dak  Miss State             4
2      Giants  Daniel        Duke             8
3      Eagles   Jalen    Oklahoma             1

In [151]:
df.groupby('QB').count()

        Team  College  Jersey_Number
QB
Dak        1        1              1
Daniel     1        1              1
Jaden      1        1              1
Jalen      1        1              1

In [153]:
df.groupby('QB').describe().transpose()['Jaden']

Team           count              1
               unique             1
               top       Commanders
               freq               1
College        count              1
               unique             1
               top              LSU
               freq               1
Jersey_Number  count              1
               unique             1
               top                5
               freq               1
Name: Jaden, dtype: object

In [154]:
df2 = df

In [157]:
df3 = pd.concat([df,df2])

In [158]:
df3

         Team      QB     College Jersey_Number
0  Commanders   Jaden         LSU             5
1     Cowboys     Dak  Miss State             4
2      Giants  Daniel        Duke             8
3      Eagles   Jalen    Oklahoma             1
0  Commanders   Jaden         LSU             5
1     Cowboys     Dak  Miss State             4
2      Giants  Daniel        Duke             8
3      Eagles   Jalen    Oklahoma             1

In [159]:
df3.drop_duplicates()

         Team      QB     College Jersey_Number
0  Commanders   Jaden         LSU             5
1     Cowboys     Dak  Miss State             4
2      Giants  Daniel        Duke             8
3      Eagles   Jalen    Oklahoma             1

In [162]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']},
    index=[0,1,2,3]
)

df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
    'D': ['D4', 'D5', 'D6', 'D7']},
        index=[4,5,6,7]
)

df3 = pd.DataFrame({
    'A': ['A8', 'A9', 'A10', 'A11'],
    'B': ['B8', 'B9', 'B10', 'B11'],
    'C': ['C8', 'C9', 'C10', 'C11'],
    'D': ['D8', 'D9', 'D10', 'D11']},
    index=[8,9,10,11]
)

In [163]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [164]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [165]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [168]:
pd.concat([df1,df2,df3], axis=0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [172]:
left_df = pd.DataFrame({
    'key': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})


right_df = pd.DataFrame({
    'key': ['K1', 'K2', 'K3', 'K4'],
    'C': ['C1', 'C2', 'C3', 'C4'],
    'D': ['D1', 'D2', 'D3', 'D4']
})

In [174]:
pd.merge(left_df, right_df, how='inner')

  key   A   B   C   D
0  K1  A1  B1  C1  D1
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [175]:
pd.merge(left_df, right_df, how='right')

  key    A    B   C   D
0  K1   A1   B1  C1  D1
1  K2   A2   B2  C2  D2
2  K3   A3   B3  C3  D3
3  K4  NaN  NaN  C4  D4

In [176]:
data = {'Team':['Commanders', 'Cowboys', 'Giants', 'Eagles'],
       'QB': ['Jaden', 'Dak', 'Daniel', 'Jalen'],
       'College': ['LSU', 'Miss State', 'Duke', 'Oklahoma']}

In [177]:
df = pd.DataFrame(data)

In [178]:
df['QB'].unique()

array(['Jaden', 'Dak', 'Daniel', 'Jalen'], dtype=object)

In [179]:
df['QB'].nunique()

4

In [180]:
df['College'].value_counts()

College
LSU           1
Miss State    1
Duke          1
Oklahoma      1
Name: count, dtype: int64

In [181]:
def times2(x):
    return x*2

In [195]:
df['Number'] = 1

In [196]:
df['Number'].apply(times2)

0    2
1    2
2    2
3    2
Name: Number, dtype: int64

In [197]:
df['QB'].apply(lambda x:x+' From the NFC East')

0     Jaden From the NFC East
1       Dak From the NFC East
2    Daniel From the NFC East
3     Jalen From the NFC East
Name: QB, dtype: object

In [198]:
df.columns

Index(['Team', 'QB', 'College', 'Number'], dtype='object')

In [199]:
df.isnull()

    Team     QB  College  Number
0  False  False    False   False
1  False  False    False   False
2  False  False    False   False
3  False  False    False   False

In [200]:
df.pivot_table(values='Number', index=['College'], columns=['Team'])

Team        Commanders  Cowboys  Eagles  Giants
College
Duke               NaN      NaN     NaN     1.0
LSU                1.0      NaN     NaN     NaN
Miss State         NaN      1.0     NaN     NaN
Oklahoma           NaN      NaN     1.0     NaN

In [201]:
df

         Team      QB     College  Number
0  Commanders   Jaden         LSU       1
1     Cowboys     Dak  Miss State       1
2      Giants  Daniel        Duke       1
3      Eagles   Jalen    Oklahoma       1